app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image", "artist", "year", "created_at", "updated_at", "user_id", "description") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def user_artworks
    user = User.find(params[:user_id])

DELETE FROM "artworks" WHERE "artworks"."id" = ?  [["id", 1]]
---
    def destroy
        artwork = find_artwork
        artwork.destroy

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_artwork
        Artwork.find(params[:id])