app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "kila"], ["password_digest", "[FILTERED]"], ["created_at", "2023-11-27 09:23:40.599783"], ["updated_at", "2023-11-27 09:23:40.599783"]]
---
    def create
    user = User.create(user_params)